homework/hw1/300mm/entrance/poiseuille_flow_axissymetric_distribution_0.6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
      type	fixedValue;
      value 	uniform (0.6 0 0);
    }
    outlet
    {
      type	zeroGradient;
    }
    walls
    {
      type	fixedValue;
      value	uniform (0 0 0);
    }
    front
    {
      type	wedge;
    }
    back
    {
      type	wedge;
    }
}

// ************************************************************************* //
