homework/hw1/300mm/entrance/poiseuille_flow_axissymetric_distribution_0.6/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication $application